; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v1 ?v8)
             (pred_11 ?v9 ?v7)
             (pred_8 ?v1 ?v7)
             (pred_5 ?v11 ?v1 )
	     (pred_6 ?v1)
             (pred_2 ?v6)
             (pred_3 ?v9)
             (pred_4 ?v7)
             (pred_12 ?v1)
             (pred_1 ?v9)
             (pred_10 ?v1)
             (pred_9 ))



(:action op_2
:parameters (?v13 ?v10 ?v4 ?v2)
:precondition (and (pred_2 ?v13) (pred_2 ?v10) (pred_3 ?v4) (pred_4 ?v2)
          (pred_7 ?v13 ?v10) (pred_11 ?v4 ?v2)
                   (pred_8 ?v10 ?v2) (pred_6 ?v13) 
                   (pred_12 ?v10) (pred_1 ?v4))
:effect (and  (pred_10 ?v10) (not (pred_12 ?v10))))


(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_2 ?v13) (pred_2 ?v12)
               (pred_6 ?v13) (pred_7 ?v13 ?v12) (pred_10 ?v12))
:effect (and (pred_6 ?v12) (not (pred_6 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_2 ?v13) (pred_3 ?v4) 
                  (pred_6 ?v13) (pred_5 ?v4 ?v13) (pred_9 ))
:effect (and (pred_1 ?v4)
   (not (pred_5 ?v4 ?v13)) (not (pred_9 ))))


(:action op_1
:parameters (?v13 ?v3 ?v5)
:precondition (and (pred_2 ?v13) (pred_3 ?v3) (pred_3 ?v5)
                  (pred_6 ?v13) (pred_1 ?v5) (pred_5 ?v3 ?v13))
:effect (and (pred_1 ?v3) (pred_5 ?v5 ?v13)
        (not (pred_1 ?v5)) (not (pred_5 ?v3 ?v13))))

(:action op_3
:parameters (?v13 ?v4)
:precondition (and (pred_2 ?v13) (pred_3 ?v4) 
                  (pred_6 ?v13) (pred_1 ?v4))
:effect (and (pred_9 ) (pred_5 ?v4 ?v13) (not (pred_1 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_12 obj_11 obj_02 obj_14 obj_13 obj_19 obj_01 obj_18 obj_17 obj_06 obj_08 obj_10 obj_16 obj_21 obj_05
    obj_04 obj_15
    obj_03 obj_20 obj_07
    )

    (:init
       (pred_9)

       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_18)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_15)
       (pred_3 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_07)

       (pred_7 obj_09 obj_14)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_14 obj_13)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_13 obj_17)
       (pred_7 obj_13 obj_19)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_13 obj_14)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_13)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_18 obj_10)
       (pred_7 obj_18 obj_17)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_17 obj_18)
       (pred_7 obj_06 obj_21)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_17)
       (pred_7 obj_08 obj_05)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_18)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_05 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_12 obj_14)
       (pred_8  obj_05 obj_04)
       (pred_8  obj_12 obj_15)
       (pred_8  obj_14 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_17)
       (pred_10 obj_06)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_10 obj_21)

       (pred_11  obj_03 obj_04)
       (pred_11  obj_20 obj_15)
       (pred_11  obj_07 obj_04)
       (pred_5 obj_03 obj_13)
       (pred_5 obj_20 obj_18)
       (pred_5 obj_07 obj_18)
       (pred_6 obj_21)
    )

    (:goal (and
       (pred_5 obj_03 obj_06)
    ))
(:constraints
  (always (not (pred_6 obj_19)))
)
)

; plan
1. (op_5 obj_21 obj_06)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_06)
   goals met: 0 of 1
2. (op_5 obj_06 obj_17)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_17)
   goals met: 0 of 1
3. (op_5 obj_17 obj_13)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_13)
   goals met: 0 of 1
4. (op_4 obj_13 obj_03)
   deleted: (pred_5 obj_03 obj_13) (pred_9)
   added: (pred_1 obj_03)
   goals met: 0 of 1
5. (op_5 obj_13 obj_17)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_17)
   goals met: 0 of 1
6. (op_5 obj_17 obj_06)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_06)
   goals met: 0 of 1
7. (op_3 obj_06 obj_03)
   deleted: (pred_1 obj_03)
   added: (pred_9) (pred_5 obj_03 obj_06)
   goals met: 1 of 1
